In [1]:
import pandas as pd
import numpy as np

In [2]:
sr = pd.Series([1,2,3,4], index=list('abcd'),name="SR1")

In [3]:
sr

a    1
b    2
c    3
d    4
Name: SR1, dtype: int64

In [4]:
sr.name

'SR1'

In [5]:
sr.dtype

dtype('int64')

In [6]:
sr.shape

(4,)

In [7]:
sr.ndim

1

In [8]:
sr.size

4

In [10]:
sr.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], index=['a','b'], columns=['c1','c2','c3','c4'])
df

   c1  c2  c3  c4
a   1   2   3   4
b   5   6   7   8

In [12]:
df.shape

(2, 4)

In [13]:
df.size

8

In [14]:
df.ndim

2

In [15]:
df.index

Index(['a', 'b'], dtype='object')

In [16]:
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 4 columns):
c1    2 non-null int64
c2    2 non-null int64
c3    2 non-null int64
c4    2 non-null int64
dtypes: int64(4)
memory usage: 80.0+ bytes

In [18]:
s = set([i for i in dir(pd.Series) if not i.startswith("_")])
d = set([i for i in dir(pd.DataFrame) if not i.startswith("_")])

count = 0
for i in (s-d):
    count += 1
    print(i, end=", ")
    if (count%4 == 0):
        print()

unique, is_monotonic, dt, value_counts,
flags, itemsize, nonzero, view,
ptp, dtype, hasnans, tolist,
cat, to_frame, real, asobject,
name, compress, divmod, item,
repeat, from_array, imag, valid,
data, str, is_monotonic_decreasing, is_monotonic_increasing,
argsort, strides, factorize, searchsorted,
map, argmax, argmin, autocorr,
base, nbytes, between, put,
ftype, ravel, is_unique,

In [ ]:
df_f = pd.read_csv('../data/series_dataframe.csv', usecols=['Member','Series','DataFrame'], encoding='euc-kr')

In [19]:
obj = pd.Series([1,2,3,4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [22]:
obj.values

array([1, 2, 3, 4])

In [23]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
obj.dtype

dtype('int64')

In [25]:
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(d, name='something')
ser

a    1
b    2
c    3
Name: something, dtype: int64

In [26]:
# 위와 같은 결과
index = ['a','b','c']
obj1 = pd.Series([1,2,3], index=index, name="TEST")
obj1

a    1
b    2
c    3
Name: TEST, dtype: int64

In [27]:
s = pd.Series(np.random.randn(5))
s

0   -1.538484
1    1.528296
2   -0.051728
3    0.499641
4   -0.575590
dtype: float64

In [28]:
obj = pd.Series([1,2,3,4], name="obj")
obj.shape, obj.ndim

((4,), 1)

In [30]:
id(obj.values)

140538485199296

In [33]:
obj.dtype, obj.nbytes

(dtype('int64'), 32)

In [34]:
obj_emp = pd.Series()
obj_emp.empty

True

In [35]:
s1 = pd.Series([1,2,3,4], name='s1')
s2 = pd.Series(['a','b','c','d'], name='s2')
df = pd.DataFrame({'s1':s1, 's2':s2})
df

   s1 s2
0   1  a
1   2  b
2   3  c
3   4  d

In [36]:
df['s1']

0    1
1    2
2    3
3    4
Name: s1, dtype: int64

In [37]:
s1 == df['s1']

0    True
1    True
2    True
3    True
Name: s1, dtype: bool

In [39]:
# 생성된 시리즈를 리스트에 넣고 생성자에 넣으면 -> 시리즈가 행으로 들어감 
# 딕셔너리처럼 키가 없어 리스트에 있는 시리즈를 보고 행의 레이블로 인식하여 행 단위로 저장
df_a = pd.DataFrame([s1,s2])
df_a

    0  1  2  3
s1  1  2  3  4
s2  a  b  c  d

In [40]:
data = {'AAA' : {'a':4,'b':5,'c':6,'d':7},'BBB' : {'a':10,'b':20,'c':30,'d':40},'CCC' : {'a':100,'b':50,'c':-30,'d':70}}
df = pd.DataFrame(data)
df

   AAA  BBB  CCC
a    4   10  100
b    5   20   50
c    6   30  -30
d    7   40   70

In [41]:
df2 = pd.DataFrame(data, columns=['AAA','CCC'])
df2

   AAA  CCC
a    4  100
b    5   50
c    6  -30
d    7   70

In [42]:
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]
BabyDataSet = list(zip(names, births)) # 튜플 만들어진 거에 다시 리스트 생성자 사용
df = pd.DataFrame(BabyDataSet, columns=['Names','Births']) # 역시 행으로 들어감 
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [43]:
df.axes, df.index, df.columns

([RangeIndex(start=0, stop=5, step=1),
  Index(['Names', 'Births'], dtype='object')],
 RangeIndex(start=0, stop=5, step=1),
 Index(['Names', 'Births'], dtype='object'))

In [44]:
df.shape, df.ndim, df.size

((5, 2), 2, 10)

In [51]:
sat = pd.read_csv("/mnt/c/Workspace/handson_pandas/data/2014_korea_sat_scores.csv", encoding='euc-kr').dropna(axis=1)
sat.head()

   등급     과목 구분점수  도수(명)  비율(%)
0   1  국어 A형  128  13866   4.30
1   2  국어 A형  123  23599   7.32
2   3  국어 A형  116  42470  13.17
3   4  국어 A형  108  52640  16.32
4   5  국어 A형   97  63896  19.81

In [52]:
sat['도수(명)'].head()

0    13866
1    23599
2    42470
3    52640
4    63896
Name: 도수(명), dtype: int64

In [53]:
(sat['도수(명)'] < 20000).head()

0     True
1    False
2    False
3    False
4    False
Name: 도수(명), dtype: bool

In [54]:
sat[sat['도수(명)'] < 20000].head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
16   8  국어 B형    59  19943   7.03
17   9  국어 B형  59미만  10868   3.83

In [55]:
l_sat = ((sat['도수(명)'] < 20000) & (sat['비율(%)'] <= 5.0))
l_sat.head()

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [56]:
l_sat.sum()

71

In [57]:
sat_logic = sat[l_sat]
sat_logic.head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
17   9  국어 B형  59미만  10868   3.83
18   1  수학 A형   137  19675   4.77

In [58]:
sat_ser = sat['도수(명)']
sat_ser[sat_ser < 20000].head()

0     13866
8     12554
9     12615
16    19943
17    10868
Name: 도수(명), dtype: int64

In [59]:
import seaborn as sns

In [60]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [61]:
titanic[['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [62]:
titanic[['age']].head() # DataFrame

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [63]:
titanic['age'].head() # Series

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [64]:
titanic_age = titanic['age']
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64

## 2.5 Indexer 검색

In [1]:
import seaborn as sns

In [2]:
diamonds = sns.load_dataset('diamonds')
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [3]:
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [4]:
diamonds.loc[0] # DataFrame의 첫 번째 행의 정보를 series로 출력

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [5]:
diamonds.loc[0,'carat']

0.23

In [7]:
diamonds.loc[:, 'carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [8]:
diamonds['carat'].head() # Series 반환

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [9]:
# 인덱서로 DataFrame 을 반환하게 하려면
diamonds.loc[:, ['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [10]:
diamonds[['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [11]:
diamonds.xs(0)

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [12]:
diamonds.xs("carat",1).head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [13]:
diamonds.lookup([0,1],['carat','cut']) # 인자로 리스트로 행과 열의 매칭 정보를 주면 Numpy 배열로 제공

array([0.23, 'Premium'], dtype=object)

In [14]:
diamonds.iloc[0]

carat       0.23
cut        Ideal
color          E
clarity      SI2
depth       61.5
table         55
price        326
x           3.95
y           3.98
z           2.43
Name: 0, dtype: object

In [15]:
diamonds.iloc[0,0]

0.23

In [17]:
diamonds.iloc[0,[0]]

carat    0.23
Name: 0, dtype: object

In [18]:
diamonds.iloc[0,[0,1,2]] # 하나의 행과 그 행의 각 열에 대한 정보를 가져다 Series 로 출력

carat     0.23
cut      Ideal
color        E
Name: 0, dtype: object

In [19]:
diamonds.iloc[:5,:3] # 행과 열에 인자로 두 개의 슬라이스를 넣으면 DataFrame 반환

   carat      cut color
0   0.23    Ideal     E
1   0.21  Premium     E
2   0.23     Good     E
3   0.29  Premium     I
4   0.31     Good     J

In [20]:
diamonds.columns

Index(['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price', 'x', 'y',
       'z'],
      dtype='object')

In [21]:
((diamonds['carat']==0.23)&(diamonds['cut']=='Very Good')).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [23]:
# 행의 인덱서에 논리식 결과를 넣고 열 인자에는 팬시 검색인 리스트에 열의 이름을 넣음
carat_cut = diamonds.loc[((diamonds['carat']==0.23)&(diamonds['cut']=='Very Good')),['carat','cut','color','price']]
carat_cut.shape
carat_cut.head()

    carat        cut color  price
9    0.23  Very Good     H    338
21   0.23  Very Good     E    352
22   0.23  Very Good     H    353
25   0.23  Very Good     G    354
28   0.23  Very Good     D    357

In [24]:
diamonds.loc[:,['carat','cut','color','price']].head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

In [25]:
abc = diamonds.loc._get_slice_axis(slice(0,len(diamonds)))
abc.__getitem__(['carat','cut','color','price']).head()

   carat      cut color  price
0   0.23    Ideal     E    326
1   0.21  Premium     E    326
2   0.23     Good     E    327
3   0.29  Premium     I    334
4   0.31     Good     J    335

In [26]:
set_i = diamonds.set_index('color')
set_i.head()

       carat      cut clarity  depth  table  price     x     y     z
color
E       0.23    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
E       0.21  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
E       0.23     Good     VS1   56.9   65.0    327  4.05  4.07  2.31
I       0.29  Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
J       0.31     Good     SI2   63.3   58.0    335  4.34  4.35  2.75

In [27]:
try:
    set_i.loc['E':'F']
except ValueError as e:
    print('ValueError', e)
except KeyError as e:
    print('KeyError', e)

KeyError "Cannot get left slice bound for non-unique label: 'E'"

In [28]:
set_i.sort_index(inplace=True)

In [29]:
try:
    set_i_str = set_i.loc['E':'F']
except ValueError as e:
    print('ValueError', e)
except KeyError as e:
    print('KeyError', e)

In [30]:
set_i_str.head()

       carat        cut clarity  depth  table  price     x     y     z
color
E       2.01      Ideal     SI2   62.2   57.0  17849  8.09  8.04  5.02
E       1.51  Very Good    VVS2   60.2   61.0  17689  7.34  7.40  4.44
E       0.50      Ideal    VVS2   61.5   57.0   2236  5.09  5.12  3.14
E       1.13      Ideal    VVS1   60.6   57.0  14525  6.72  6.77  4.09
E       1.51      Ideal     VS2   62.7   57.0  14482  7.31  7.26  4.57

## 2.6 갱신과 삭제 처리

In [2]:
import pandas as pd
movies = pd.read_csv("/mnt/c/Workspace/handson_pandas/data/movies.csv", usecols=['Film','Year'])
movies.head()

                                 Film  Year
0          Zack and Miri Make a Porno  2008
1                     Youth in Revolt  2010
2  You Will Meet a Tall Dark Stranger  2010
3                        When in Rome  2010
4               What Happens in Vegas  2008

In [34]:
movies_add = pd.read_csv("/mnt/c/Workspace/handson_pandas/data/movies.csv")
movies_add.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008

In [35]:
movies['has_seen'] = 0
movies.head()

                                 Film  Year  has_seen
0          Zack and Miri Make a Porno  2008         0
1                     Youth in Revolt  2010         0
2  You Will Meet a Tall Dark Stranger  2010         0
3                        When in Rome  2010         0
4               What Happens in Vegas  2008         0

In [36]:
movies['has_seen'] = (movies_add['Audience score %'] + movies_add['Rotten Tomatoes %'])//2
movies.head()

                                 Film  Year  has_seen
0          Zack and Miri Make a Porno  2008        67
1                     Youth in Revolt  2010        60
2  You Will Meet a Tall Dark Stranger  2010        39
3                        When in Rome  2010        29
4               What Happens in Vegas  2008        50

In [37]:
movies_add['Worldwide Gross'].dtype

dtype('O')

In [38]:
d = movies_add['Worldwide Gross'].str.replace('$','').astype('float64')
d.head()

0     41.94
1     19.62
2     26.66
3     43.04
4    219.37
Name: Worldwide Gross, dtype: float64

In [39]:
movies.columns.get_loc('has_seen')

2

In [40]:
movies.insert(movies.columns.get_loc('has_seen')+1, "원화환산", d*1200)
movies.head()

                                 Film  Year  has_seen      원화환산
0          Zack and Miri Make a Porno  2008        67   50328.0
1                     Youth in Revolt  2010        60   23544.0
2  You Will Meet a Tall Dark Stranger  2010        39   31992.0
3                        When in Rome  2010        29   51648.0
4               What Happens in Vegas  2008        50  263244.0

In [41]:
movies.loc[74,'has_seen']

84

In [42]:
import numpy as np
movies.loc[74, 'has_seen'] = np.nan
movies.loc[74,'has_seen']

nan

In [43]:
movies_ser_at = movies['Year']
movies_ser_at.head()

0    2008
1    2010
2    2010
3    2010
4    2008
Name: Year, dtype: int64

In [44]:
movies_ser_at.put(0,2024)

In [45]:
movies_ser_at.get(0)

2024

In [46]:
movies_del = pd.read_csv("/mnt/c/Workspace/handson_pandas/data/movies.csv")
movies_del.shape

(77, 8)

In [48]:
movies_del1 = movies_del.drop('Rotten Tomatoes %', axis=1) # 열 단위 삭제
movies_del1.head()
movies_del1.shape

(77, 7)

In [49]:
movies_del2 = movies_del.drop([1,2,3,4],axis=0) # 행 단위 삭제
movies_del2.shape

(73, 8)

In [50]:
movies_del3 = movies_del.drop(['Lead Studio', 'Worldwide Gross'], axis=1)
movies_del3.shape

(77, 6)

## 2.7 문자열 데이터 처리

In [60]:
movies_str = pd.read_csv("/mnt/c/Workspace/handson_pandas/data/korea_movie_list.csv", encoding='cp949')
movies_str.columns

Index(['movie_code', 'title', 'title_Eng', 'show_time', 'produce_year',
       'open_date', 'produce_state', 'type', 'nation', 'genre', 'director',
       'actor', 'show_type', 'watch_grade'],
      dtype='object')

In [61]:
movies_str.head()

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN
2,20187641,극장판 도라에몽: 진구의 보물섬,NaN,107.0,2018,20180815,개봉예정,장편,일본,애니메이션/SF/어드벤처,이마이 카즈아키,윤아영/김정아/조현정/최낙윤/이현주/임은정/김정은/이지현/이경태/강은애/박성영/이다...,"2D,디지털더빙",전체관람가
3,20187427,명탐정 코난 : 제로의 집행인,Detective Conan: Zero the Enforcer,110.0,2018,20180808,개봉예정,장편,일본,애니메이션,타치카와 유즈루,타카야마 미나미/야마자키 와카나/코야마 리키야/푸루야 토루,"2D,디지털/2D,디지털더빙",12세이상관람가
4,20173732,살아남은 아이,Last Child,123.0,2017,20180830,개봉예정,장편,한국,드라마,신동석,최무성/김여진/성유빈,"2D,디지털",NaN

In [65]:
movies_str_ser = movies_str['title']
movies_str_eng = movies_str['title_Eng']
movies_str_ser.hasnans

False

In [66]:
movies_str_eng.hasnans

True

In [68]:
movies_str_eng = movies_str_eng.dropna()

In [70]:
movies_str_ser.str.len().head() # Series를 string으로 변환

0     7
1     7
2    17
3    16
4     7
Name: title, dtype: int64

In [72]:
movies_str_ser.str.find('할로우').head()

0    0
1   -1
2   -1
3   -1
4   -1
Name: title, dtype: int64

In [73]:
movies_str_ser.str.count('의').head()

0    0
1    1
2    1
3    1
4    0
Name: title, dtype: int64

In [77]:
si = str('  찬혁  ')
print(len(si))
si = si.strip()
print(si)

6
찬혁

In [78]:
idx = pd.Index([' 찬혁 ',' 런던 ',' 소셜 ',' 겨울 '])
idx.str.strip()

Index(['찬혁', '런던', '소셜', '겨울'], dtype='object')

In [79]:
idx.str.lstrip()

Index(['찬혁 ', '런던 ', '소셜 ', '겨울 '], dtype='object')

In [5]:
import numpy as np
ss = pd.Series(['가_나_다', '라_마_바', np.nan, '사_아_자'])
ss.str.split('_')

0    [가, 나, 다]
1    [라, 마, 바]
2          NaN
3    [사, 아, 자]
dtype: object

In [82]:
ss.str.split('_').str.get(1)

0      나
1      마
2    NaN
3      아
dtype: object

In [83]:
ss.str.split('_', expand=True) # 기존 분리된 것을 기준으로 해서 DataFrame 반환

     0    1    2
0    가    나    다
1    라    마    바
2  NaN  NaN  NaN
3    사    아    자

In [84]:
ss.str.split('_', expand=True, n=1) # 하나의 열만 추가

     0    1
0    가  나_다
1    라  마_바
2  NaN  NaN
3    사  아_자

In [86]:
ss.str.rsplit('_', expand=True, n=1) # 하나의 열만 추가 (오른쪽을 기준으로 만듬)

     0    1
0  가_나    다
1  라_마    바
2  NaN  NaN
3  사_아    자

In [87]:
ss.str.replace("_","%")

0    가%나%다
1    라%마%바
2      NaN
3    사%아%자
dtype: object

In [88]:
ss.str.cat(sep=",")

'가_나_다,라_마_바,사_아_자'

In [89]:
# 기존에 작성된 것에 새로운 것을 붙이려면 인자로 행의 개수에 맞도록 지정해 주어야 함
ss.str.cat(['A','B','C','D'])

0    가_나_다A
1    라_마_바B
2       NaN
3    사_아_자D
dtype: object

In [90]:
su = pd.Series(['A','B','C','D'])
ss.str.cat(su)

0    가_나_다A
1    라_마_바B
2       NaN
3    사_아_자D
dtype: object

In [6]:
ss.str[0]

0      가
1      라
2    NaN
3      사
dtype: object